hubuhubu/nrf52-ble-mesh-data-collector/ble_app_uart - Mesh - Gateway/main.c
                     memcpy(&sensor_data[p_evt->params.rx.value_handle*SENSOR_DATA_SIZE],p_evt->params.rx.p_data,  p_evt->params.rx.data_len);
                     if (( !(p_evt->params.rx.p_data[0]%2))&&(p_evt->params.rx.value_handle<4))
                    {
                            NRF_GPIO->OUTSET = (1 << (p_evt->params.rx.value_handle + LED_START-1));
                    }
                    else
                    {
                            NRF_GPIO->OUTCLR = (1 << (p_evt->params.rx.value_handle + LED_START-1));
                    }
                    break;
                    
            }   

        
            break;

        case RBC_MESH_EVENT_TYPE_TX:
            break;

        case RBC_MESH_EVENT_TYPE_INITIALIZED:
            /* init BLE gateway softdevice application: */
            //nrf_adv_conn_init();
            break;
        default:
            break;
    }

     
}
static void fs_evt_handler(fs_evt_t const * const evt, fs_ret_t result)
{
    if (result != FS_SUCCESS)
    {printf("    ISSUE   \n\r");
        //bsp_indication_set(BSP_INDICATE_FATAL_ERROR);
    }
		else
		{
				printf("    fstorage command successfully completed   \n\r");
				fs_callback_flag = 0;
		}
}
/*
static void fstorage_test(void)
{
		static uint32_t data;
		uint32_t flash_data[4];
	
		
		
		fs_ret_t ret = fs_init();
		if (ret != FS_SUCCESS)
		{
					printf("ISSUE");
		}
		
		// Erase one page (page 0).
		printf("Erasing a flash page at address 0x%X\r\n", (uint32_t)fs_config.p_start_addr);
		fs_callback_flag = 1;
		ret = fs_erase(&fs_config, fs_config.p_start_addr, 1,NULL);
		if (ret != FS_SUCCESS)
		{
			printf("ISSUE");
		}
		while(fs_callback_flag == 1)  { //power_manage();
            }
		
		//Read the first 4 words of the page
		printf("Data read from flash address 0x%X: ", (uint32_t)fs_config.p_start_addr);
		for(int i=0; i<4; i++)
		{
				flash_data[i] = *(fs_config.p_start_addr + i);
				printf("%X ", flash_data[i]);
		}
		printf("\r\n");
		
		//Write the first byte
		data = 0xAAAAAAAA;
		printf("Writing data 0x%X to address 0x%X\r\n", data, (uint32_t)fs_config.p_start_addr);
		fs_callback_flag = 1;
		ret = fs_store(&fs_config, fs_config.p_start_addr, &data, 1,NULL);      //Write data to memory address 0x0003F000. Check it with command: nrfjprog --memrd 0x0003F000 --n 16
		if (ret != FS_SUCCESS)
		{
				bsp_indication_set(BSP_INDICATE_FATAL_ERROR);
		}
		while(fs_callback_flag == 1)  { power_manage(); }
		
		//Write second byte
		data = 0xBBBBBBBB;
		printf("Writing data 0x%X to address 0x%X\r\n", data, (uint32_t)fs_config.p_start_addr + 4);
		fs_callback_flag = 1;
		ret = fs_store(&fs_config, fs_config.p_start_addr + 1, &data, 1,NULL);      //Write data to memory address 0x0003F000. Check it with command: nrfjprog --memrd 0x0003F000 --n 16
		if (ret != FS_SUCCESS)
		{
				bsp_indication_set(BSP_INDICATE_FATAL_ERROR);
		}
		while(fs_callback_flag == 1)  { power_manage(); }
		
		//Read the first 4 words of the page
		printf("Data read from flash address 0x%X: ", (uint32_t)fs_config.p_start_addr);
        memcpy(flash_data,fs_config.p_start_addr,6);
		for(int i=0; i<4; i++)
		{
		//		flash_data[i] = *(fs_config.p_start_addr + i);
				printf("%X ", flash_data[i]);
		}
		printf("\r\n");
}*/
void initialize_node_id_table(void)
{
    //If button 4 is pressed , erase Node_ID_table , otherwise restore it from flash
    if(nrf_gpio_pin_read(BUTTON_4) == 0){
        
        memset(Node_ID_table, INVALID_CHIP_ID, sizeof(Node_ID_table));  
        fs_callback_flag=1;
        uint32_t ret = fs_erase(&fs_config, fs_config.p_start_addr, 1,NULL);
		APP_ERROR_CHECK(ret);
		while(fs_callback_flag == 1);
    }else{
        
    memcpy(Node_ID_table,fs_config.p_start_addr,sizeof(Node_ID_table));
    }
    
}  
/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;
    rbc_mesh_event_t evt;
		uint8_t mesh_data[2];
    // Initialize.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
	timers_init();

    uart_init();
    log_init();

    leds_buttons_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    //fstorage_test();
    fs_init();
    initialize_node_id_table();
    
	rbc_mesh_init_params_t init_params;
   
    // while(1);
    init_params.access_addr = MESH_ACCESS_ADDR;
    init_params.interval_min_ms = MESH_INTERVAL_MIN_MS;
    init_params.channel = MESH_CHANNEL;
    init_params.lfclksrc = MESH_CLOCK_SOURCE;
    init_params.tx_power = RBC_MESH_TXPOWER_0dBm ;
    
    err_code = rbc_mesh_init(init_params);
    APP_ERROR_CHECK(err_code);

    /* enable handle ID for all nodes*/
    for (uint32_t i = 0; i < MAX_NODE; ++i)
    {
        err_code = rbc_mesh_value_enable(i);
        APP_ERROR_CHECK(err_code);
    }
	//Set initial version for commission handle
    err_code = rbc_mesh_value_set(COMMISSION_HANDLE,mesh_data,0);    
	//memset(Node_ID_table, INVALID_CHIP_ID, sizeof(Node_ID_table));
		
	//printf("\r\n HANDLE ID %x - %x \r\n", Node_ID_table[1],Node_ID_table[2]);
    NRF_LOG_INFO("UART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    application_timers_start();
    // Enter main loop.
    for (;;)
    {
        if (rbc_mesh_event_get(&evt) == NRF_SUCCESS)
        {   
            rbc_mesh_event_handler(&evt);
            rbc_mesh_event_release(&evt);
        }
    }
}


/**
 * @}
 */
